import ApexCharts from 'apexcharts'
import moment from "moment";

var series = [{"data":[{"x":"2024-09-06","y":3}],"name":"Улица Фадеев ручей"},{"data":[{"x":"2024-08-09","y":6},{"x":"2024-08-10","y":8},{"x":"2024-08-11","y":9},{"x":"2024-08-12","y":7},{"x":"2024-08-13","y":6},{"x":"2024-08-14","y":5},{"x":"2024-08-15","y":2},{"x":"2024-08-16","y":5},{"x":"2024-08-17","y":6},{"x":"2024-08-18","y":6},{"x":"2024-08-19","y":9},{"x":"2024-08-20","y":12},{"x":"2024-08-21","y":8},{"x":"2024-08-22","y":6},{"x":"2024-08-23","y":5},{"x":"2024-08-24","y":4},{"x":"2024-08-25","y":1},{"x":"2024-08-26","y":6},{"x":"2024-08-27","y":3},{"x":"2024-08-28","y":4},{"x":"2024-08-29","y":3},{"x":"2024-08-30","y":3},{"x":"2024-08-31","y":2},{"x":"2024-09-01","y":1},{"x":"2024-09-02","y":6},{"x":"2024-09-03","y":5},{"x":"2024-09-04","y":4},{"x":"2024-09-05","y":7},{"x":"2024-09-06","y":5},{"x":"2024-09-07","y":6},{"x":"2024-09-08","y":4}],"name":"Улица Челюскинцев"},{"data":[{"x":"2024-08-10","y":2}],"name":"Семёновское озеро"},{"data":[{"x":"2024-08-09","y":10},{"x":"2024-08-10","y":7},{"x":"2024-08-11","y":3},{"x":"2024-08-16","y":1}],"name":"Семеновское озеро"},{"data":[],"name":"Площадь Пять Углов"},{"data":[],"name":"Привокзальная площадь"},{"data":[{"x":"2024-08-09","y":6},{"x":"2024-08-10","y":2},{"x":"2024-08-11","y":7},{"x":"2024-08-12","y":3},{"x":"2024-08-13","y":3},{"x":"2024-08-14","y":3},{"x":"2024-08-15","y":3},{"x":"2024-08-16","y":4},{"x":"2024-08-17","y":8},{"x":"2024-08-18","y":4},{"x":"2024-08-19","y":11},{"x":"2024-08-20","y":5},{"x":"2024-08-21","y":2},{"x":"2024-08-22","y":2},{"x":"2024-08-23","y":5},{"x":"2024-08-24","y":5},{"x":"2024-08-25","y":6},{"x":"2024-08-26","y":3},{"x":"2024-08-27","y":5},{"x":"2024-08-28","y":4},{"x":"2024-08-29","y":1},{"x":"2024-08-30","y":1},{"x":"2024-09-01","y":2},{"x":"2024-09-02","y":1},{"x":"2024-09-04","y":2},{"x":"2024-09-05","y":1},{"x":"2024-09-06","y":1},{"x":"2024-09-07","y":2},{"x":"2024-09-08","y":2}],"name":"Улица Капитана Пономарева"},{"data":[{"x":"2024-08-09","y":3},{"x":"2024-08-10","y":6},{"x":"2024-08-11","y":5},{"x":"2024-08-12","y":3},{"x":"2024-08-13","y":6},{"x":"2024-08-14","y":6},{"x":"2024-08-15","y":4},{"x":"2024-08-16","y":3},{"x":"2024-08-17","y":10},{"x":"2024-08-18","y":6},{"x":"2024-08-19","y":5},{"x":"2024-08-20","y":1},{"x":"2024-08-21","y":7},{"x":"2024-08-22","y":3},{"x":"2024-08-23","y":5},{"x":"2024-08-24","y":8},{"x":"2024-08-25","y":3},{"x":"2024-08-26","y":6},{"x":"2024-08-27","y":5},{"x":"2024-08-28","y":4},{"x":"2024-08-29","y":4},{"x":"2024-08-30","y":6},{"x":"2024-08-31","y":3},{"x":"2024-09-01","y":2},{"x":"2024-09-02","y":5},{"x":"2024-09-03","y":5},{"x":"2024-09-04","y":4},{"x":"2024-09-05","y":2},{"x":"2024-09-06","y":5},{"x":"2024-09-08","y":5},{"x":"2024-09-09","y":1}],"name":"Кинотеатр \"Мурманск\""},{"data":[],"name":"Кладбище"},{"data":[{"x":"2024-08-30","y":1},{"x":"2024-09-05","y":1},{"x":"2024-09-06","y":1}],"name":"Фадеев ручей"},{"data":[],"name":"Проспект Ленина"},{"data":[],"name":"Автошкола"},{"data":[],"name":"Улица Шевченко"},{"data":[{"x":"2024-09-06","y":1}],"name":"Долина Уюта"},{"data":[],"name":"пл. Кола"},{"data":[],"name":"Улица Академика Павлова"},{"data":[],"name":"Улица Капитана Маклакова"},{"data":[{"x":"2024-08-23","y":1}],"name":"Улица Генерала Фролова"},{"data":[{"x":"2024-08-27","y":1}],"name":"Ловозеро ДРСУ"},{"data":[{"x":"2024-08-27","y":1}],"name":"Автобусная остановка Ловозеро"},{"data":[{"x":"2024-09-05","y":1},{"x":"2024-09-06","y":2}],"name":"310 микрорайон"},{"data":[{"x":"2024-09-06","y":1}],"name":"Улица Алексея Хлобыстова"},{"data":[{"x":"2024-09-06","y":1}],"name":"Улица Карла Либкнехта"},{"data":[{"x":"2024-09-06","y":1}],"name":"Улица Володарского"},{"data":[{"x":"2024-09-06","y":1}],"name":"Улица Юрия Гагарина"},{"data":[{"x":"2024-09-06","y":2}],"name":"Улица Чумбарова-Лучинского"},{"data":[{"x":"2024-09-06","y":1}],"name":"Улица Магомета Гаджиева"},{"data":[{"x":"2024-09-06","y":1}],"name":"Улица Александра Невского"},{"data":[{"x":"2024-09-06","y":1}],"name":"ул. Магомета Гаджиева"},{"data":[{"x":"2024-09-06","y":2}],"name":"Почта"},{"data":[{"x":"2024-09-06","y":1}],"name":"Улица Достоевского"},{"data":[{"x":"2024-09-06","y":1}],"name":"Улица Ломоносова"},{"data":[{"x":"2024-09-06","y":1}],"name":"Троллейбусное депо №1"},{"data":[{"x":"2024-09-06","y":2}],"name":"Улица Траловая"},{"data":[{"x":"2024-09-06","y":1}],"name":"Плавательный бассейн"},{"data":[{"x":"2024-09-06","y":2}],"name":"Переулок Якорный"},{"data":[{"x":"2024-09-06","y":1}],"name":"Озеро Ледовое"},{"data":[{"x":"2024-09-06","y":2}],"name":"Улица Первомайская"},{"data":[{"x":"2024-09-06","y":1}],"name":"Проспект Кольский"},{"data":[{"x":"2024-09-06","y":2}],"name":"Проспект Кирова"},{"data":[{"x":"2024-09-06","y":1}],"name":"Областная больница"},{"data":[{"x":"2024-09-06","y":2}],"name":"Переулок Хибинский"},{"data":[{"x":"2024-09-06","y":2}],"name":"Восьмая проходная"},{"data":[{"x":"2024-09-06","y":1}],"name":"Улица Академика Книповича"},{"data":[{"x":"2024-09-06","y":1}],"name":"Улица Морская"},{"data":[{"x":"2024-09-06","y":1}],"name":"Мурманский арктический университет"},{"data":[{"x":"2024-09-06","y":1}],"name":"ОМСЧ \"Севрыба\""},{"data":[{"x":"2024-09-06","y":1}],"name":"СК \"Долина Уюта\""},{"data":[{"x":"2024-09-06","y":1}],"name":"Улица Зои Космодемьянской"},{"data":[{"x":"2024-09-06","y":1}],"name":"Поликлиника"},{"data":[{"x":"2024-09-06","y":1}],"name":"Горнолыжный склон"},{"data":[{"x":"2024-09-06","y":1}],"name":"Школа"},{"data":[{"x":"2024-09-06","y":1}],"name":"Нефтебаза"},{"data":[{"x":"2024-09-06","y":2}],"name":"Южные причалы"},{"data":[{"x":"2024-09-06","y":2}],"name":"Коптильный завод"},{"data":[{"x":"2024-09-06","y":1}],"name":"Улица Фестивальная"},{"data":[{"x":"2024-09-06","y":1}],"name":"Улица Каменная"},{"data":[{"x":"2024-09-06","y":2}],"name":"Улица Капитана Орликовой"},{"data":[{"x":"2024-09-06","y":2}],"name":"Лыжный проезд"},{"data":[{"x":"2024-09-06","y":2}],"name":"Улица Героев Рыбачьего"},{"data":[{"x":"2024-09-06","y":1}],"name":"Улица Крупской"},{"data":[{"x":"2024-09-06","y":1}],"name":"Авторынок"},{"data":[{"x":"2024-09-06","y":1}],"name":"Улица Фрунзе"},{"data":[{"x":"2024-09-06","y":2}],"name":"Склады"},{"data":[{"x":"2024-09-06","y":1}],"name":"Улица Бочкова"},{"data":[{"x":"2024-09-06","y":1}],"name":"Улица Бондарная"},{"data":[{"x":"2024-09-06","y":1}],"name":"Улица Генерала Щербакова"},{"data":[{"x":"2024-09-06","y":2}],"name":"Улица Беринга"},{"data":[{"x":"2024-09-06","y":1}],"name":"Улица Баумана"},{"data":[{"x":"2024-09-06","y":1}],"name":"улица Достоевского"}]
var options = {
  chart: {
    type: "bar",
    stacked: true,
    height: 400,
    toolbar: {
      tools: {
        download: false,
        selection: true,
        zoom: true,
        zoomin: true,
        zoomout: true,
        pan: true,
        reset: true | '<img src="/static/icons/reset.png" width="20">'
      }
    }
  },
  dataLabels: {
    enabled: false
  },
  stroke: { show: false },
  yaxis: [{
    show: false
  }],
  xaxis: {
    type: "datetime",
    labels: {
      formatter: val => moment(val).format("DD.MM")
    }
  },
  zoom: {
    type: "x",
    enabled: true
  },
  tooltip: {
    shared: true,
    intersect: false,
    followCursor: true,
    x: {
      formatter: val => moment(val).format("DD MMMM YYYY года (dddd)")
    }
  },
  legend: { show: false },
  series
}

var chart = new ApexCharts(document.querySelector('#app'), options);

chart.render();